dlc/app/controllers/users_controller.rb

INSERT INTO `users` (`last_login_at`, `last_request_at`, `updated_at`, `crypted_password`, `single_access_token`, `perishable_token`, `current_login_ip`, `password_salt`, `current_login_at`, `username`, `pseudonym`, `failed_login_count`, `persistence_token`, `login_count`, `openid_identifier`, `email`, `last_login_ip`, `created_at`) VALUES(NULL, '2010-03-19 04:06:05', '2010-03-19 04:06:05', 'c427e29a5620ad503bbd3a79b76f277be4b1be6865905f9ccb2c571e01a864e1fe50dcb012272634060679f61907bc62fd72e76649d64d6d92046b4693afeb69', 'RWwLFggoFUUiz4T8cS_z', '6EEjeF8KxQFwaLS70acb', '127.0.0.1', 'aIseFVVYUacXhKrswRxy', '2010-03-19 04:06:05', 'cwest', NULL, 0, 'fe36ca34a15b351c41bddab0e3380090dcb19409ba34a7643d6fc3855bb5c6f742daa771e05e0624e2c873445512637ae9fcefdeb2d423dd1953e7c022b6310b', 1, 'http://caseywest.com/', 'casey@geeknest.com', NULL, '2010-03-19 04:06:05')
INSERT INTO `baselines` (`errands_alone`, `updated_at`, `green_miles`, `work_green`, `school_alone`, `errands_green`, `work_alone`, `school_green`, `kids_green`, `faith_green`, `social_green`, `total_miles`, `user_id`, `faith_alone`, `duration`, `kids_alone`, `social_alone`, `created_at`) VALUES(NULL, '2010-03-29 20:23:31', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2010-03-29 20:23:31')
---
  def create
    @user = User.new(params[:user])
    @user.save do |result|
      if result
        flash[:notice] = "Registration successful."
        redirect_to root_url
      else
        render :action => 'new'
      end
    end
    @user.baseline = Baseline.create

UPDATE `users` SET `perishable_token` = 'DfX-eF8JyzzoJGoCdUBW', `updated_at` = '2010-04-01 22:30:35', `last_request_at` = '2010-04-01 22:30:35' WHERE `id` = 1
---
  def update
    @user = current_user
    @user.attributes = params[:user]
    @user.save do |result|